OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1946.h
#define TUN0                    OSCTUNEbits.TUN0                // bit 0
#define TUN1                    OSCTUNEbits.TUN1                // bit 1
#define TUN2                    OSCTUNEbits.TUN2                // bit 2
#define TUN3                    OSCTUNEbits.TUN3                // bit 3
#define TUN4                    OSCTUNEbits.TUN4                // bit 4
#define TUN5                    OSCTUNEbits.TUN5                // bit 5

#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0
#define NOT_POR                 PCONbits.NOT_POR                // bit 1
#define NOT_RI                  PCONbits.NOT_RI                 // bit 2
#define NOT_RMCLR               PCONbits.NOT_RMCLR              // bit 3
#define STKUNF                  PCONbits.STKUNF                 // bit 6
#define STKOVF                  PCONbits.STKOVF                 // bit 7

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define TMR2IE                  PIE1bits.TMR2IE                 // bit 1
#define CCP1IE                  PIE1bits.CCP1IE                 // bit 2
#define SSP1IE                  PIE1bits.SSP1IE                 // bit 3, shadows bit in PIE1bits
#define SSPIE                   PIE1bits.SSPIE                  // bit 3, shadows bit in PIE1bits
#define TX1IE                   PIE1bits.TX1IE                  // bit 4, shadows bit in PIE1bits
#define TXIE                    PIE1bits.TXIE                   // bit 4, shadows bit in PIE1bits
#define RC1IE                   PIE1bits.RC1IE                  // bit 5, shadows bit in PIE1bits
#define RCIE                    PIE1bits.RCIE                   // bit 5, shadows bit in PIE1bits
#define ADIE                    PIE1bits.ADIE                   // bit 6
#define TMR1GIE                 PIE1bits.TMR1GIE                // bit 7

#define CCP2IE                  PIE2bits.CCP2IE                 // bit 0
#define C3IE                    PIE2bits.C3IE                   // bit 1
#define LCDIE                   PIE2bits.LCDIE                  // bit 2
#define BCLIE                   PIE2bits.BCLIE                  // bit 3
#define EEIE                    PIE2bits.EEIE                   // bit 4
#define C1IE                    PIE2bits.C1IE                   // bit 5
#define C2IE                    PIE2bits.C2IE                   // bit 6
#define OSFIE                   PIE2bits.OSFIE                  // bit 7

#define TMR4IE                  PIE3bits.TMR4IE                 // bit 1
#define TMR6IE                  PIE3bits.TMR6IE                 // bit 3
#define CCP3IE                  PIE3bits.CCP3IE                 // bit 4
#define CCP4IE                  PIE3bits.CCP4IE                 // bit 5
#define CCP5IE                  PIE3bits.CCP5IE                 // bit 6

#define SSP2IE                  PIE4bits.SSP2IE                 // bit 0
#define BCL2IE                  PIE4bits.BCL2IE                 // bit 1
#define TX2IE                   PIE4bits.TX2IE                  // bit 4
#define RC2IE                   PIE4bits.RC2IE                  // bit 5

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0
#define TMR2IF                  PIR1bits.TMR2IF                 // bit 1
#define CCP1IF                  PIR1bits.CCP1IF                 // bit 2
#define SSP1IF                  PIR1bits.SSP1IF                 // bit 3, shadows bit in PIR1bits
#define SSPIF                   PIR1bits.SSPIF                  // bit 3, shadows bit in PIR1bits
#define TX1IF                   PIR1bits.TX1IF                  // bit 4, shadows bit in PIR1bits
#define TXIF                    PIR1bits.TXIF                   // bit 4, shadows bit in PIR1bits
#define RC1IF                   PIR1bits.RC1IF                  // bit 5, shadows bit in PIR1bits
#define RCIF                    PIR1bits.RCIF                   // bit 5, shadows bit in PIR1bits
#define ADIF                    PIR1bits.ADIF                   // bit 6
#define TMR1GIF                 PIR1bits.TMR1GIF                // bit 7

#define CCP2IF                  PIR2bits.CCP2IF                 // bit 0
#define C3IF                    PIR2bits.C3IF                   // bit 1
#define LCDIF                   PIR2bits.LCDIF                  // bit 2
#define BCLIF                   PIR2bits.BCLIF                  // bit 3
#define EEIF                    PIR2bits.EEIF                   // bit 4
#define C1IF                    PIR2bits.C1IF                   // bit 5
#define C2IF                    PIR2bits.C2IF                   // bit 6
#define OSFIF                   PIR2bits.OSFIF                  // bit 7

#define TMR4IF                  PIR3bits.TMR4IF                 // bit 1
#define TMR6IF                  PIR3bits.TMR6IF                 // bit 3
#define CCP3IF                  PIR3bits.CCP3IF                 // bit 4
#define CCP4IF                  PIR3bits.CCP4IF                 // bit 5
#define CCP5IF                  PIR3bits.CCP5IF                 // bit 6

#define SSP2IF                  PIR4bits.SSP2IF                 // bit 0
#define BCL2IF                  PIR4bits.BCL2IF                 // bit 1
#define TX2IF                   PIR4bits.TX2IF                  // bit 4
#define RC2IF                   PIR4bits.RC2IF                  // bit 5

#define RA0                     PORTAbits.RA0                   // bit 0, shadows bit in PORTAbits
#define AN0                     PORTAbits.AN0                   // bit 0, shadows bit in PORTAbits
#define CPS0                    PORTAbits.CPS0                  // bit 0, shadows bit in PORTAbits
#define SEG33                   PORTAbits.SEG33                 // bit 0, shadows bit in PORTAbits
#define RA1                     PORTAbits.RA1                   // bit 1, shadows bit in PORTAbits
#define AN1                     PORTAbits.AN1                   // bit 1, shadows bit in PORTAbits
#define CPS1                    PORTAbits.CPS1                  // bit 1, shadows bit in PORTAbits
#define SEG18                   PORTAbits.SEG18                 // bit 1, shadows bit in PORTAbits
#define RA2                     PORTAbits.RA2                   // bit 2, shadows bit in PORTAbits
#define AN2                     PORTAbits.AN2                   // bit 2, shadows bit in PORTAbits
#define CPS2                    PORTAbits.CPS2                  // bit 2, shadows bit in PORTAbits
#define SEG34                   PORTAbits.SEG34                 // bit 2, shadows bit in PORTAbits
#define VREFM                   PORTAbits.VREFM                 // bit 2, shadows bit in PORTAbits
#define RA3                     PORTAbits.RA3                   // bit 3, shadows bit in PORTAbits
#define AN3                     PORTAbits.AN3                   // bit 3, shadows bit in PORTAbits
#define CPS3                    PORTAbits.CPS3                  // bit 3, shadows bit in PORTAbits
#define SEG35                   PORTAbits.SEG35                 // bit 3, shadows bit in PORTAbits
#define VREFP                   PORTAbits.VREFP                 // bit 3, shadows bit in PORTAbits
#define RA4                     PORTAbits.RA4                   // bit 4, shadows bit in PORTAbits
#define SEG14                   PORTAbits.SEG14                 // bit 4, shadows bit in PORTAbits
#define T0CKI                   PORTAbits.T0CKI                 // bit 4, shadows bit in PORTAbits
#define RA5                     PORTAbits.RA5                   // bit 5, shadows bit in PORTAbits
#define AN4                     PORTAbits.AN4                   // bit 5, shadows bit in PORTAbits
#define CPS4                    PORTAbits.CPS4                  // bit 5, shadows bit in PORTAbits
#define SEG15                   PORTAbits.SEG15                 // bit 5, shadows bit in PORTAbits
#define RA6                     PORTAbits.RA6                   // bit 6, shadows bit in PORTAbits
#define SEG36                   PORTAbits.SEG36                 // bit 6, shadows bit in PORTAbits
#define OSC2                    PORTAbits.OSC2                  // bit 6, shadows bit in PORTAbits
#define CLKOUT                  PORTAbits.CLKOUT                // bit 6, shadows bit in PORTAbits
#define RA7                     PORTAbits.RA7                   // bit 7, shadows bit in PORTAbits
#define SEG37                   PORTAbits.SEG37                 // bit 7, shadows bit in PORTAbits
#define OSC1                    PORTAbits.OSC1                  // bit 7, shadows bit in PORTAbits
#define CLKIN                   PORTAbits.CLKIN                 // bit 7, shadows bit in PORTAbits

#define RB0                     PORTBbits.RB0                   // bit 0, shadows bit in PORTBbits
#define SEG30                   PORTBbits.SEG30                 // bit 0, shadows bit in PORTBbits
#define SRI                     PORTBbits.SRI                   // bit 0, shadows bit in PORTBbits
#define FLT0                    PORTBbits.FLT0                  // bit 0, shadows bit in PORTBbits
#define RB1                     PORTBbits.RB1                   // bit 1, shadows bit in PORTBbits
#define SEG8                    PORTBbits.SEG8                  // bit 1, shadows bit in PORTBbits
#define RB2                     PORTBbits.RB2                   // bit 2, shadows bit in PORTBbits
#define SEG9                    PORTBbits.SEG9                  // bit 2, shadows bit in PORTBbits
#define RB3                     PORTBbits.RB3                   // bit 3, shadows bit in PORTBbits
#define SEG10                   PORTBbits.SEG10                 // bit 3, shadows bit in PORTBbits
#define RB4                     PORTBbits.RB4                   // bit 4, shadows bit in PORTBbits
#define SEG11                   PORTBbits.SEG11                 // bit 4, shadows bit in PORTBbits
#define RB5                     PORTBbits.RB5                   // bit 5, shadows bit in PORTBbits
#define SEG29                   PORTBbits.SEG29                 // bit 5, shadows bit in PORTBbits
#define T1G                     PORTBbits.T1G                   // bit 5, shadows bit in PORTBbits
#define RB6                     PORTBbits.RB6                   // bit 6, shadows bit in PORTBbits
#define SEG38                   PORTBbits.SEG38                 // bit 6, shadows bit in PORTBbits
#define RB7                     PORTBbits.RB7                   // bit 7, shadows bit in PORTBbits
#define SEG39                   PORTBbits.SEG39                 // bit 7, shadows bit in PORTBbits

#define RC0                     PORTCbits.RC0                   // bit 0, shadows bit in PORTCbits
#define SEG40                   PORTCbits.SEG40                 // bit 0, shadows bit in PORTCbits
#define T1OSO                   PORTCbits.T1OSO                 // bit 0, shadows bit in PORTCbits
#define T1CKI                   PORTCbits.T1CKI                 // bit 0, shadows bit in PORTCbits
#define RC1                     PORTCbits.RC1                   // bit 1, shadows bit in PORTCbits
#define SEG32                   PORTCbits.SEG32                 // bit 1, shadows bit in PORTCbits
#define T1OSI                   PORTCbits.T1OSI                 // bit 1, shadows bit in PORTCbits
#define CCP2                    PORTCbits.CCP2                  // bit 1, shadows bit in PORTCbits
#define P2A                     PORTCbits.P2A                   // bit 1, shadows bit in PORTCbits
#define RC2                     PORTCbits.RC2                   // bit 2, shadows bit in PORTCbits
#define SEG13                   PORTCbits.SEG13                 // bit 2, shadows bit in PORTCbits
#define CCP1                    PORTCbits.CCP1                  // bit 2, shadows bit in PORTCbits
#define P1A                     PORTCbits.P1A                   // bit 2, shadows bit in PORTCbits
#define RC3                     PORTCbits.RC3                   // bit 3, shadows bit in PORTCbits
#define SEG17                   PORTCbits.SEG17                 // bit 3, shadows bit in PORTCbits
#define SCK1                    PORTCbits.SCK1                  // bit 3, shadows bit in PORTCbits
#define SCL1                    PORTCbits.SCL1                  // bit 3, shadows bit in PORTCbits
#define RC4                     PORTCbits.RC4                   // bit 4, shadows bit in PORTCbits
#define SEG16                   PORTCbits.SEG16                 // bit 4, shadows bit in PORTCbits
#define SDI1                    PORTCbits.SDI1                  // bit 4, shadows bit in PORTCbits
#define SDA1                    PORTCbits.SDA1                  // bit 4, shadows bit in PORTCbits
#define RC5                     PORTCbits.RC5                   // bit 5, shadows bit in PORTCbits
#define SEG12                   PORTCbits.SEG12                 // bit 5, shadows bit in PORTCbits
#define SDO1                    PORTCbits.SDO1                  // bit 5, shadows bit in PORTCbits
#define RC6                     PORTCbits.RC6                   // bit 6, shadows bit in PORTCbits
#define SEG27                   PORTCbits.SEG27                 // bit 6, shadows bit in PORTCbits
#define TX1                     PORTCbits.TX1                   // bit 6, shadows bit in PORTCbits
#define CK1                     PORTCbits.CK1                   // bit 6, shadows bit in PORTCbits
#define RC7                     PORTCbits.RC7                   // bit 7, shadows bit in PORTCbits
#define SEG28                   PORTCbits.SEG28                 // bit 7, shadows bit in PORTCbits
#define RX1                     PORTCbits.RX1                   // bit 7, shadows bit in PORTCbits
#define DT1                     PORTCbits.DT1                   // bit 7, shadows bit in PORTCbits

#define RD0                     PORTDbits.RD0                   // bit 0, shadows bit in PORTDbits
#define SEG0                    PORTDbits.SEG0                  // bit 0, shadows bit in PORTDbits
#define P2D                     PORTDbits.P2D                   // bit 0, shadows bit in PORTDbits
#define RD1                     PORTDbits.RD1                   // bit 1, shadows bit in PORTDbits
#define SEG1                    PORTDbits.SEG1                  // bit 1, shadows bit in PORTDbits
#define P2C                     PORTDbits.P2C                   // bit 1, shadows bit in PORTDbits
#define RD2                     PORTDbits.RD2                   // bit 2, shadows bit in PORTDbits
#define SEG2                    PORTDbits.SEG2                  // bit 2, shadows bit in PORTDbits
#define P2B                     PORTDbits.P2B                   // bit 2, shadows bit in PORTDbits
#define RD3                     PORTDbits.RD3                   // bit 3, shadows bit in PORTDbits
#define SEG3                    PORTDbits.SEG3                  // bit 3, shadows bit in PORTDbits
#define P3C                     PORTDbits.P3C                   // bit 3, shadows bit in PORTDbits
#define RD4                     PORTDbits.RD4                   // bit 4, shadows bit in PORTDbits
#define SEG4                    PORTDbits.SEG4                  // bit 4, shadows bit in PORTDbits
#define P3B                     PORTDbits.P3B                   // bit 4, shadows bit in PORTDbits
#define SDO2                    PORTDbits.SDO2                  // bit 4, shadows bit in PORTDbits
#define RD5                     PORTDbits.RD5                   // bit 5, shadows bit in PORTDbits
#define SEG5                    PORTDbits.SEG5                  // bit 5, shadows bit in PORTDbits
#define P1C                     PORTDbits.P1C                   // bit 5, shadows bit in PORTDbits
#define SDI2                    PORTDbits.SDI2                  // bit 5, shadows bit in PORTDbits
#define SDA2                    PORTDbits.SDA2                  // bit 5, shadows bit in PORTDbits
#define RD6                     PORTDbits.RD6                   // bit 6, shadows bit in PORTDbits
#define SEG6                    PORTDbits.SEG6                  // bit 6, shadows bit in PORTDbits
#define P1B                     PORTDbits.P1B                   // bit 6, shadows bit in PORTDbits
#define SCK2                    PORTDbits.SCK2                  // bit 6, shadows bit in PORTDbits
#define SCL2                    PORTDbits.SCL2                  // bit 6, shadows bit in PORTDbits
#define RD7                     PORTDbits.RD7                   // bit 7, shadows bit in PORTDbits
#define SEG7                    PORTDbits.SEG7                  // bit 7, shadows bit in PORTDbits
#define NOT_SS2                 PORTDbits.NOT_SS2               // bit 7, shadows bit in PORTDbits

#define STR1A                   PSTR1CONbits.STR1A              // bit 0
#define STR1B                   PSTR1CONbits.STR1B              // bit 1
#define STR1C                   PSTR1CONbits.STR1C              // bit 2
#define STR1D                   PSTR1CONbits.STR1D              // bit 3
#define STR1SYNC                PSTR1CONbits.STR1SYNC           // bit 4

#define STR2A                   PSTR2CONbits.STR2A              // bit 0
#define STR2B                   PSTR2CONbits.STR2B              // bit 1
#define STR2C                   PSTR2CONbits.STR2C              // bit 2
#define STR2D                   PSTR2CONbits.STR2D              // bit 3
#define STR2SYNC                PSTR2CONbits.STR2SYNC           // bit 4

